org/org-docs/tdd-card-display-simple/card_new.org
*** test/test_card.so のビルド

    src/libcard.a が更新されているので，test/test_card.so を作り直しま
    す。
    
#+BEGIN_SRC sh :results output :dir babel/simple/no_new/test :exports both
# ~/progs/card_display/simple/test/
make clean
make test_card.so
#+END_SRC

#+RESULTS:
: rm -f *.o *.so *~ \#* *.gch
: gcc -c test_card.c -fPIC -I../src `pkg-config cutter --cflags`
: gcc -o test_card.so --shared test_card.o -L../src/ -lcard `pkg-config cutter --libs`

    test/test_card.so ができればテストの実行に移ります。

    できない時は，多分，Makefile に間違いがあります。Makefile を修正してください。

*** テストの実行

    テストの作成と機能の実装が終ったので，機能が要求を満たすことを確か
    めるためにテストする:

#+BEGIN_SRC sh :results output :dir babel/simple/card_new/ :exports both
# ~/progs/card_display/simple
cutter -v v test
#+END_SRC

#+RESULTS:
: test_card:
:   test_card_no_new_from_string:				.: (0.000136)
:   test_card_suit_new_from_string:			.: (0.000079)
:   test_card_new:					.: (0.000044)
: 
: Finished in 0.001173 seconds (total: 0.000259 seconds)
: 
: 3 test(s), 11 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
: 100% passed

*** テストと再設計

    テストが成功すれば，テストによる開発の1サイクルが完結したことにな
    ります。

    テストが失敗した場合は，test/test_card.c, src/{card.h, card.c} を
    修正していくことになります。

    ソースコードを修正した後は，Makefileに間違いがなけれ
    ば，~/progs/card_display/simpleで make すれば，全自動でテストまで
    実行してくれます。テストが成功するまで繰り返してください。

