docs/org-docs/tdd-card-display-simple/card_new.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> テスト</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> test/test<sub>card</sub>.so のビルド</h3>
<div class="outline-text-3" id="text-3-1">
<p>
src/libcard.a が更新されているので，test/test<sub>card</sub>.so を作り直しま
す。
</p>

<div class="org-src-container">

<pre class="src src-sh"># ~/progs/card_display/simple/test/
make clean
make test_card.so
</pre>
</div>

<pre class="example">
rm -f *.o *.so *~ \#* *.gch
gcc -c test_card.c -fPIC -I../src `pkg-config cutter --cflags`
gcc -o test_card.so --shared test_card.o -L../src/ -lcard `pkg-config cutter --libs`
</pre>

<p>
test/test<sub>card</sub>.so ができればテストの実行に移ります。
</p>

<p>
できない時は，多分，Makefile に間違いがあります。Makefile を修正してください。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> テストの実行</h3>
<div class="outline-text-3" id="text-3-2">
<p>
テストの作成と機能の実装が終ったので，機能が要求を満たすことを確か
めるためにテストする:
</p>

<div class="org-src-container">

<pre class="src src-sh"># ~/progs/card_display/simple
cutter -v v test
</pre>
</div>

<pre class="example">
test_card:
  test_card_no_new_from_string:                         .: (0.000136)
  test_card_suit_new_from_string:                       .: (0.000079)
  test_card_new:                                        .: (0.000044)

Finished in 0.001173 seconds (total: 0.000259 seconds)

3 test(s), 11 assertion(s), 0 failure(s), 0 error(s), 0 pending(s), 0 omission(s), 0 notification(s)
100% passed
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> テストと再設計</h3>
<div class="outline-text-3" id="text-3-3">
<p>
テストが成功すれば，テストによる開発の1サイクルが完結したことにな
ります。
</p>

<p>
テストが失敗した場合は，test/test<sub>card</sub>.c, src/{card.h, card.c} を
修正していくことになります。
</p>

<p>
ソースコードを修正した後は，Makefileに間違いがなけれ
ば，~/progs/card<sub>display</sub>/simpleで make すれば，全自動でテストまで
実行してくれます。テストが成功するまで繰り返してください。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2016-12-13 火 15:16</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="https://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
